app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    #raise @cart.to_yaml
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    #@line_item.product = product

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 03 Dec 2012 06:15:53 UTC +00:00], ["updated_at", Mon, 03 Dec 2012 06:15:53 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 21], ["created_at", Mon, 07 Jan 2013 13:02:53 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Mon, 07 Jan 2013 13:02:53 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-12-03 06:16:09.537758' WHERE "line_items"."id" = 4