app/controllers/orders_controller.rb

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "pan"], ["created_at", Mon, 07 Jan 2013 13:08:03 UTC +00:00], ["email", "pan@gmx.de"], ["name", "peter"], ["pay_type", "Check"], ["updated_at", Mon, 07 Jan 2013 13:08:03 UTC +00:00]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 22]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])